do
 function run(msg, matches)
if is_momod(msg) then
return [[💠لیست دستورات پلاگین های فان ربات💠:

!admins
💢نمایش ادمین های گروه💢

!owner
💢نشان دادن صاحب گروه💢

!modlist
⁉️لیست کمک مدیر ها⁉️

!id
🆔گرفتن ایدی عددی(کد)🆔

!id from
🔴گرفتن ایدی از متن فروارد شده با ریپلای🔴

!kickme
🔵کیک کردن فرد فرستنده از گروه🔵


!rules
📛قوانین گروه📛

!time
⏰نشاندادن ساعت اسلامی با استیکر

write (متن مورد نظر با خارجی و عدد) 

🔲ربات متن شمارا به 100 شکل مینویسد
!arz
💰نشان دادن ارز طلا و سکه و...
!cap
🔵با رپلی بر روی عکس مورد نظر ربات متن زیر عکس را به شما میدهد
!aparat (نام فیلم یا چیزی ک در آپارات نیاز دارید)
👛ربات موارد پیدا شدرو براتون میاره
!azan (نام شهر)
🕋ربات مشخصات اذان شهر را به شما میدهد
]]
end
end
return {
patterns = {
    "^[!#/](helpfan)$",
},
run = run
}
end
