do
 function run(msg, matches)
if not is_sudo(msg) then
return "😐 کیر شدی 😂 فقط سودوها"
end
if is_sudo(msg) then
return [[👑راهنما ی سودو ها👑
🔶#add 
🔵اضافه کردن گروه به لیست گروه های ربات
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔷#rem 
🔴حذف کردن گروه از لیست گرو های ربات
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔶#reload 
🔵ریستارت کردن تمام پوشه های سرور
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔷#tosuper 
🔴ارتقا دادن گروه به سوپر گروه
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔶plug 
🔵نشان دادن لیست پلاگین ها
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔷plug *
🔴ریستارت کردن پلاگین ها بدون رفتین ب سرور
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔶plug - نام پلاگین
🔵غیر فعال کردن پلاگین بدون رفتن ب سرور
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔷plug + نام پلاگین
🔴فعال کردن پپلاگین بدون رفتن ب سرور
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔶#banall {آیدی ,یوزر ,ریپله ی}
🔵محروم کردن کاربر از همه گروه ها
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔷#unbanall {آیدی ,یوزر ,ریپله ی}
🔴آزاد کردن از محرومیت همه گروه ها
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔶#setowner {آیدی ,یوزر ,ریپله ی}
🔵حتما وقتی ربات را اد کردین سازنده گپ را اونر گروه کنید با دستور بالا
〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰〰
🔰ساپورت 1 ماه گروه یا ماهانه 5 تومن
🔰ساپورت همیشگی 10 تومن
]]
end
end
return {
patterns = {
    "^[!#/](helpsudo)$",
},
run = run
}
end
